princeton/ipvs/results/timeseries/time-scales/3_X_max/single-backend/500ms-fluctuation/3mins-run/1ms-feedback/feedback-wlc/3333-seed/run/httperf_client_123.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=24 --send-buffer=4096 --recv-buffer=16384 --num-conns=4320 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
            10.5 133
            11.5 551
            12.5 379
            13.5 360
            14.5 366
            15.5 328
            16.5 403
            17.5 265
            18.5 182
            19.5 186
            20.5 150
            21.5 155
            22.5 113
            23.5 124
            24.5 86
            25.5 59
            26.5 52
            27.5 61
            28.5 39
            29.5 36
            30.5 38
            31.5 30
            32.5 33
            33.5 24
            34.5 19
            35.5 20
            36.5 12
            37.5 12
            38.5 7
            39.5 10
            40.5 1
            41.5 3
            42.5 4
            43.5 2
            44.5 9
            45.5 2
            46.5 2
            47.5 4
            48.5 3
            49.5 3
            50.5 2
            51.5 2
            52.5 3
             :
            54.5 2
            55.5 1
            56.5 2
             :
            59.5 1
             :
            62.5 2
             :
            76.5 1
             :
            90.5 1
             :
            92.5 1
             :
           110.5 2
             :
           143.5 1
             :
           151.5 1
             :
           158.5 1
             :
           160.5 1
           161.5 1
             :
           170.5 1
             :
           182.5 1
           183.5 1
             :
           202.5 1
             :
           206.5 1
             :
           213.5 1
             :
           215.5 1
             :
           220.5 1
           221.5 1
             :
           231.5 1
             :
           233.5 1
           234.5 1
             :
           239.5 1
             :
           242.5 1
           243.5 1
             :
           255.5 1
             :
           261.5 1
             :
           270.5 1
             :
           272.5 1
             :
           282.5 1
             :
           284.5 1
             :
           286.5 1
           287.5 1
             :
           309.5 1
             :
           313.5 1
             :
           323.5 1
             :
           329.5 1
             :
           360.5 1
             :
           375.5 1

Total: connections 4320 requests 4320 replies 4320 test-duration 179.976 s

Connection rate: 24.0 conn/s (41.7 ms/conn, <=3 concurrent connections)
Connection time [ms]: min 10.3 avg 19.6 max 375.6 median 16.5 stddev 21.7
Connection time [ms]: connect 0.7
Connection length [replies/conn]: 1.000

Request rate: 24.0 req/s (41.7 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 23.0 avg 24.0 max 25.0 stddev 0.3 (179 samples)
Percentages of the replies served at a given rate:
   50%: 23
   66%: 23
   75%: 23
   80%: 23
   90%: 23
   95%: 23
   98%: 24
   99%: 24
  100%: 25

Reply time [ms]: response 18.2 transfer 0.6
Percentages of the requests served within a certain time (ms) :
   50%: 14
   66%: 16
   75%: 19
   80%: 20
   90%: 25
   95%: 30
   98%: 38
   99%: 54
  100%: 375

Reply size [B]: header 162.0 content 72.0 footer 1.0 (total 235.0)
Reply status: 1xx=0 2xx=4320 3xx=0 4xx=0 5xx=0

CPU time [s]: user 148.29 system 31.32 (user 82.4% system 17.4% total 99.8%)
Net I/O: 7.1 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0